package com.yixin.kepler.v1.common.constants;

/**
 * 工行拒绝驳回码值
 * Package : com.yixin.kepler.v1.common.constants
 * 
 * @author YixinCapital -- chen.lin
 *		   2018年10月15日 下午9:12:50
 *
 */
public class IcbcErrorConstant {
	
	/**
	 * 拒绝码值集合
	 */
    public static final String[] REFUSE_CODE = {"00001001",//合同拒绝 
    		"90000001",//征信不通过
    		"90000002",//电话核实不通过
    		"90000003",//面签非本人
    		"90000004",//客户所述内容与申请资料不符
    		"90000005",//重查人行客户资质劣变
    		"90000006",//命中黑名单
    		"90000007",//命中灰名单
    		"90000008",//反欺诈不通过
    		"90000009",//反洗钱不通过
    		"90000099"//其他原因
    		};


	/**
	 * 驳回码值集合
	 */
    public static final String[] REJECT_CODE = {"2000XXXX",//系统判断自动退回
    		"3000XXXX",//人工判断退回
    		"30000001",//提交的资料不全【人工退回】
    		"30000003",//内容填写错【人工退回】
    		"30000099",//其他原因【人工退回】
    		"4000XXXX",//系统判断退回上一审批阶段
    		"5000XXXX",//人工判断退回上一审批阶段
    		"50000001",//提交的资料不全【人工退回，需重新审批】
    		"50000003",//内容填写错【人工退回，需重新审批】
    		"50000099"//其他原因【人工退回，需重新审批】
    		};
}
